<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadType</key>
            <string>com.apple.webContentFilter</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadIdentifier</key>
            <string>com.marceausolutions.dumbphone.webfilter</string>
            <key>PayloadUUID</key>
            <string>A1B2C3D4-E5F6-7890-ABCD-EF1234567890</string>
            <key>PayloadDisplayName</key>
            <string>Dumb Phone Web Filter</string>
            <key>PayloadDescription</key>
            <string>Limits web browsing to essential sites only during focus mode</string>
            <key>FilterType</key>
            <string>BuiltIn</string>
            <key>AutoFilterEnabled</key>
            <true/>
            <key>PermittedURLs</key>
            <array>
                <string>https://mail.google.com</string>
                <string>https://calendar.google.com</string>
                <string>https://maps.google.com</string>
                <string>https://claude.ai</string>
                <string>https://dashboard.stripe.com</string>
                <string>https://marceausolutions.com</string>
            </array>
        </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>Dumb Phone Mode</string>
    <key>PayloadIdentifier</key>
    <string>com.marceausolutions.dumbphone.profile</string>
    <key>PayloadOrganization</key>
    <string>Marceau Solutions</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>F1E2D3C4-B5A6-7890-FEDC-BA9876543210</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadDescription</key>
    <string>Restricts your iPhone to essential functions only. Remove this profile in Settings to restore full access.</string>
</dict>
</plist>
